// 1. Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години
//    попадає число (в першу, другу, третю или четверту частину години).

// let time = +prompt('Введіть числом частину години від 0 до 59');
// if (time !== 0 && time < 15) {
//     document.write('Дане число попадає в першу частину години')
// } else if (time > 15 && time < 30) {
//     document.write('Дане число попадає в другу частину години');
// } else if (time > 30 && time < 45) {
//     document.write('Дане число попадає в третю частину години');
// } else if (time > 45 && time < 60) {
//     document.write('Дане число попадає в четверту частину години');
// } else {
//     document.write('Ви ввели невірно попробуйте ще раз');
// }



// 2. У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число
//    (у першу, другу чи третю).

// let day = +prompt('Введіть числом день місяця (від 1 до 31)');
// if (day === 0) {
//     document.write('Такого дня місяця неіснує');
// } else if (day <= 10) {
//     document.write('Дане число місяця попадає в першу декаду місяця');
// } else if (day <= 21) {
//     document.write('Дане число місяця попадає в другу декаду місяця');
// } else if (day <= 31) {
//     document.write('Дане число місяця попадає в третю декаду місяця');
// } else {
//     document.write('Ви ввели невірно попробуйте ще раз');
// }



// 3. У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.Перевірте роботу
//    скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test;
// if (test !== true) {
//     document.write('Вірно');
// } else {
//     document.write('Неправильно');
// }

// let test = true;
// let value = test === true ? 'Невірно' : 'Неправильно';
// document.write(value);

// let test = false;
// let value = test === false ? 'Вірно' : 'Неправильно';
// document.write(value);

// Але такий запис я вважаю є не зовсім коректний, оскільки получається якийсь десонанз де ми дублюємо інформацію і так
// логічну два рази і можна записати це або одним if з трьома умовами true, false і в будь яких інших випадках
// 'Неправильно', або тернарним виразом який правда не дуже читабельний типу:
// let test;
// let value = test === true ? 'Невірно' : test === false ? 'Вірно' : 'Неправильно';



// 4. Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт
//    при a, що дорівнює 1, 0, -3

// let a;
// a = 1;
// a = 0;
// a = -3;
// if (a !== 0) {
//     document.write('Вірно');
// } else {
//     document.write('Невірно');
// }




// 5. Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані
//    відображається інфа що заплановано на цей день.

// let numDay = +prompt('Введіть номер тиждня (де 1 - понеділок, а 7 - неділя), щоб дізнатися, що заплановано' +
//            'в цей день для Березовського Андрія');
// let day = {
//         monday:    '1. Доздаю ДЗ і класну роботу по попередньому завданні<br/>' +
//                    '2. Переглядаю превю до нової теми',
//         tuesday:   '1. Роблю ДЗ і класну роботу по новій темі',
//         wednesday: '1. Займаюсь спортом</br>' +
//                    '2. Переглядаю превю нової теми',
//         thursday:  '1. Роблю ДЗ і класну роботу по новій темі</br>' +
//                    '2. Читаю книгу',
//         friday:    '1. Доздаю ДЗ і класну роботу по попередньому завданні<br/>' +
//                    '2. Дивлюсь превю по новій темі',
//         saturday:  '1. Вивчаю англійську мову</br>' +
//                    '2. Роблю ДЗ і класну роботу по новій темі</br>' +
//                    '3. Віддихаю',
//         sunday:    '1. Віддихаю'
//     }
//
// switch (numDay) {
//     case 1:
//         document.write(day.monday);
//         break;
//     case 2:
//         document.write(day.tuesday);
//         break;
//     case 3:
//         document.write(day.wednesday);
//         break;
//     case 4:
//         document.write(day.thursday);
//         break;
//     case 5:
//         document.write(day.friday);
//         break;
//     case 6:
//         document.write(day.saturday);
//         break;
//     case 7:
//         document.write(day.sunday);
//         break;
//     default:
//         document.write('Ви ввели невірно попробуйте ще раз');
//         break;
// }



// 6. Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let age = +prompt('Введіть числом якийсь рік, щоб дізнитися чи він являється Високосним')
// if (age % 4 === 0) {
//     document.write('Це Висосний рік');
// } else {
//     document.write('Це не Високосний рік');
// }



// 7. Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
//    Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!»

// let value = prompt('Яка «офіційна» назва JavaScript?');
// if (value === 'ECMAScript') {
//     document.write('Правильно!');
// } else {
//     document.write('Не знаєте? ECMAScript!');
// }