// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат
//    цих чисел в змінній result.
let number = [ Math.random()*5, Math.random()*10, Math.random()*7, Math.random()*11,
               Math.random()*15, Math.random()*4, Math.random()*4,Math.random()*45,
               Math.random()*100, Math.random()*23 ];
let result = Math.floor(number[0] + number[1] + number[2] + number[3] + number[4] +
                           number[5] + number[6] + number[7] + number[8] + number[9]);
console.log(result);


// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
// let book = {
//     name: 'Оно',
//     pages: '1138',
//     genre: 'ужаси'


// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
// let book = {
//     name: 'Біле ікло',
//     pages: '256',
//     genre: 'пригодницька повість',
//     author: 'Джек Лондон'
// }


// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори.
//    Вивести кожну книгу як окремий об'єкт
// let book = [
//     {
//         name: 'Монах, який продав свій Феррарі',
//         pages: '224',
//         genre: 'роман',
//         author: 'Робін Шарма'
//     },
//     {
//         name: 'Парфюмер',
//         pages: '280',
//         genre: 'драма/Притча',
//         author: 'Патрик Зюскинд'
//     },
//     {
//         name: 'Пригоди Тома Соєра',
//         pages: '275',
//         genre: 'пригодницький роман',
//         author: 'Марк Твен'
//     }
// ]
// console.log(book[0]);
// console.log(book[1]);
// console.log(book[2]);


// 5. Напишіть код, який вираховує площу прямокутника висотою 23см (змінна height) та шириною 10см (змінна width).
//    Значення площі зберігати в змінній s.
// let height = 23;
// let width = 10;
// let c = (1/2 * height * width);


// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
//    результат помістіть у змінну v.
// let heightC = 10;
// let dC = 4;
// let v = Math.PI * Math.pow(dC/2, 2) * heightC;


// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
//    Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь)
//    або оператор зведення в ступінь **).
// let n = 3;
// let m = 4;
// let k = Math.pow(n, 2) + Math.pow(m, 2);

