// 1. Користувач вводить або має два числа.Потрібно знайти та вивести максимальне число з тих двох .
//    Також потрібно врахувати коли введені рівні числа.

// let a = +prompt('Введіть перше число');
// let b = +prompt('Введіть друге число');
// if (a > b) {
//     document.write('Число ' + a + ' більше');
// } else if (a < b) {
//     document.write('Число ' + b + ' більше');
// } else if (a === b) {
//     document.write('Обидва числа рівні між собою');
// } else {
//     document.write('Ви ввели невірні дані');
// }



// 2.  У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.Користувач вводить номер
//     квартири просто в змінні або через prompt('') .Програма повинна зазначити, в якому під'їзді
//     знаходиться дана квартира.

// let numFlat = +prompt('Введіть номер квартири(1-90)');
// if (numFlat !== 0 && numFlat <= 20) {
//     document.write('Квартира ' + numFlat + ' знаходиться у першому підїзді');
// } else  if (numFlat > 20 && numFlat <=48) {
//     document.write('Квартира ' + numFlat + ' знаходиться у другому підїзді');
// } else if (numFlat > 48 && numFlat <= 90) {
//     document.write('Квартира ' + numFlat + ' знаходиться у третьому підїзді');
// } else {
//     document.write('Такого номера квартири немає');
// }



// 3. Ми маємо змінну number в яку користувач задає числове значення, якщо змінна рівна 10 вивести повідомлення ВІРНО,
//    якщо змінна не рівна 10 - тоді НЕВІРНО

// let number;
// if (number === 10) {
//     document.write('ВІРНО');
// } else {
//     document.write('НЕВІРНО');
// }
// // З умови задачі випливає що тільки коли змінна === 10 буде ВІРНО, тому я вважаю що не має потреби додаткової
// // перевірки а якщо ні !==, тому зразу можна написати else



// 4. Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//    якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
//    якщо в змінну записали щось інше, спрацьовує else

// let x;
// if (typeof x === "number") {
//     document.write('1');
// } else if (typeof x === "string") {
//     document.write('2');
// } else if (typeof x === "boolean") {
//     document.write('3');
// } else if (typeof x === "object") {
//     document.write('3');
// } else {
//     document.write('невідомо');
// }



// 5. Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?". Змінна, яка характеризує температуру.
//    Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//    Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temperature = +prompt('Введіть свою температуру щоб дізнатися чи Ви йдете сьогодні в OKTEN на навчання?')
// if (temperature >= 10 && temperature <= 22) {
//     document.write('Ви йдете сьогодні на навчання');
// } else {
//     document.write('Ви сидите дома і навчаєтесь ОНЛАЙН');
// }



// 6. За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності
//    від введеного числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести
//    Повідомлення - що число не вірне ... .

// let num = +prompt('Введіть число від 1 до 5');
// switch (num) {
//     case 1:
//         document.write('Ви виграли авто');
//         break;
//     case 2:
//         document.write('Ви виграли мотоцикл');
//         break;
//     case 3:
//         document.write('Ви виграли квартиру');
//         break;
//     case 4:
//         document.write('Ви виграли тедефон');
//         break;
//     case 5:
//         document.write('Ви виграли подорож');
//         break;
//     default:
//         document.write('Число не вірне');
//         break;
// }