// 1. Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//    кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив,
//    в якому  3 і більше елементи. Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому
//    менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friends.length >= 3) {
//     document.write('Це великий масив');
// } else {
//     document.write('Це маленький масив');
// }



// 2. Маємо 3 числа і між ним  нам потрібно знайти те що посередині.Знайти, яке з них є середнім
//   (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let a = +prompt('Введіть перше число');
// let b = +prompt('Введіть друге число');
// let c = +prompt('Введіть третє число');
// if ((a > b && a < c) || (a < b && a > c)) {
//     document.write('Число ' + a + ' є середнім');
// } else if ((b < a && b > c) || (b > a && b < c)) {
//     document.write('Число ' + b + ' є середнім');
// } else if ((c < a && c > b) || (c > a && c < b)) {
//     document.write('Число ' + c + ' є середнім');
// }
// Не впевнений, що до кінця зрозумів умову але я так розумію: якщо розглядати перше речення завдання то виходить
// логічним, що друге число буде постійно середнім. Наступне речення завдання де число має бути більше від одного але
// менше за інше зробив, але третє речення трохи не зовсім логічне "Перевірити, чи знаходиться перше число між двома
// іншими" оскільки я получається в даному рішенні перевірив любих три числа і якщо буде варіант, що воно
// підходить під першу умову то воно й буде середнім і знаходитися між двома іншими. Надіюсь я правильно зрозумів і
// зробив і тільки це й було потрібно


// 3. Перепишіть конструкцію if з використанням умовного оператора '?':
//    let result;
//    if (a + b < 4) {
//        result = 'Мало';
//    } else {
//        result = 'Багато';
//    }

// let result = a + b < 4 ? 'Мало' : 'Багато';
// document.write(result);



// 4. Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
//    напишіть це тернарним оператором

// let i;
// let result = i >= -100 && i < 0 ? 'Негативне число' : i === 0 ? 'Ноль' : i > 0 && i <= 100 ? 'Позитивне число' : 'Невідомо'
// document.write(result);